app/controllers/etymologies_controller.rb

  def index
    @etymologies = Etymology.all
---
SELECT "etymologies".* FROM "etymologies"

  def create
    @etymology = Etymology.new(etymology_params)

    if @etymology.save
---
INSERT INTO "etymologies" ("type_etymology", "language", "graeco_latin_etymology", "pattern", "meaning_etymology", "image_etymology", "etymos_version_etymology", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def destroy
    @etymology.destroy
---
DELETE FROM "etymologies" WHERE "etymologies"."id" = $1  [["id", 4]]

    def set_etymology
      @etymology = Etymology.find(params[:id])
---
SELECT  "etymologies".* FROM "etymologies" WHERE "etymologies"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]