app/controllers/find_etymologies_controller.rb

  def find_etymology
    @etymologies = Etymology.find_by(graeco_latin_etymology: etymology_params[:graeco_latin_etymology], pattern: etymology_params[:pattern], meaning_etymology: etymology_params[:meaning_etymology])
    if @etymologies == nil
      @etymologies = Etymology.create(etymology_params)
---
SELECT  "etymologies".* FROM "etymologies" WHERE "etymologies"."graeco_latin_etymology" = $1 AND "etymologies"."pattern" = $2 LIMIT $3  [["graeco_latin_etymology", "τόμος"], ["pattern", "tomía"], ["LIMIT", 1]]
INSERT INTO "etymologies" ("type_etymology", "language", "graeco_latin_etymology", "pattern", "meaning_etymology", "image_etymology", "etymos_version_etymology", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"