app/controllers/options_controller.rb

  def index
    @options = Option.all
---
SELECT "options".* FROM "options"

  def create
    @option = Option.new(option_params)

    if @option.save
---
INSERT INTO "options" ("word_option", "correct", "test_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["word_option", "hipopótamo"], ["correct", true], ["test_id", 1], ["created_at", "2018-10-13 04:45:17.292282"], ["updated_at", "2018-10-13 04:45:17.292282"]]

  def destroy
    @option.destroy
---
DELETE FROM "options" WHERE "options"."id" = $1  [["id", 2]]

    def set_option
      @option = Option.find(params[:id])
---
SELECT  "options".* FROM "options" WHERE "options"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]