app/controllers/tests_controller.rb

  def index
    @tests = Test.all
---
SELECT "tests".* FROM "tests"

  def create
    @test = Test.new(test_params)

    if @test.save
---
INSERT INTO "tests" ("phrase", "word_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["phrase", "Nunca había visto un ___ tan grande."], ["word_id", 1], ["created_at", "2018-10-13 04:42:41.351810"], ["updated_at", "2018-10-13 04:42:41.351810"]]