app/controllers/words_controller.rb

SELECT "words".* FROM "words"
---
  def index
    @words = Word.all

INSERT INTO "words" ("word_word", "meaning_word", "image_word", "etymos_version_word", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @word = Word.new(word_params)

    if @word.save