app/controllers/word_etymologies_controller.rb

INSERT INTO "word_etymologies" ("word_id", "etymology_id", "created_at", "updated_at", "etymology_order") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["word_id", 1], ["etymology_id", 1], ["created_at", "2018-12-07 07:21:09.232695"], ["updated_at", "2018-12-07 07:21:09.232695"], ["etymology_order", 1]]
---
  def create
    @word_etymology = WordEtymology.new(word_etymology_params)

    if @word_etymology.save

SELECT  "word_etymologies".* FROM "word_etymologies" WHERE "word_etymologies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_word_etymology
      @word_etymology = WordEtymology.find(params[:id])