app/models/word.rb

SELECT  "words".* FROM "words" ORDER BY "words"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT  "words".* FROM "words" WHERE "words"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def self.get_words(words)
    temp = []
    words[:words].each do |word|
      new_word = Word.find(word[:id])